app/controllers/books_controller.rb

INSERT INTO `books` (`book_name`, `author`, `price`, `created_at`, `updated_at`) VALUES ('C programmng', 'abc', 200.0, '2021-02-03 12:50:53.206019', '2021-02-03 12:50:53.206019')
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE `books` SET `books`.`price` = 300.0, `books`.`updated_at` = '2021-02-03 12:51:07.249847' WHERE `books`.`id` = 1
---
  def update
    respond_to do |format|
      if @book.update(book_params)